In [2]:
%load_ext sql

In [3]:
%sql sqlite:///C:\Users\bilene\Downloads\book.db

In [5]:
output = %sql SELECT * FROM indicators0

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

In [8]:
output

[('CHN', 1386.4, 12143.5, 76.4, 1469.88),
 ('FRA', 66.87, 2586.29, 82.5, 69.02),
 ('GBR', 66.06, 2637.87, 81.2, 79.1),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9),
 ('USA', 325.15, 19485.4, 78.5, 391.6)]

In [10]:
import pandas as pd
df = pd.DataFrame(output)
print(df)

  code      pop       gdp  life     cell
0  CHN  1386.40  12143.50  76.4  1469.88
1  FRA    66.87   2586.29  82.5    69.02
2  GBR    66.06   2637.87  81.2    79.10
3  IND  1338.66   2652.55  68.8  1168.90
4  USA   325.15  19485.40  78.5   391.60

In [24]:
%%sql
SELECT * FROM indicators
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(1960, 'ABW', 0.05, None, 65.7, 0.0, None, None),
 (1960, 'AFG', 9.0, 0.54, 32.3, 0.0, None, 49.9),
 (1960, 'AGO', 5.45, None, 33.3, 0.0, 127.5, 123.3),
 (1960, 'ALB', 1.61, None, 62.3, 0.0, None, None),
 (1960, 'AND', 0.01, None, None, 0.0, None, None)]

In [15]:
%%sql
output2 <<
SELECT * FROM indicators

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.
Returning data to local variable output2

In [16]:
pd.DataFrame(output2)

       year code    pop     gdp  life  cell  imports  exports
0      1960  ABW   0.05     NaN  65.7   0.0      NaN      NaN
1      1960  AFG   9.00    0.54  32.3   0.0      NaN     49.9
2      1960  AGO   5.45     NaN  33.3   0.0    127.5    123.3
3      1960  ALB   1.61     NaN  62.3   0.0      NaN      NaN
4      1960  AND   0.01     NaN   NaN   0.0      NaN      NaN
...     ...  ...    ...     ...   ...   ...      ...      ...
12857  2018  XKX   1.85    7.90   NaN   NaN      NaN      NaN
12858  2018  YEM  28.50   26.91   NaN   NaN      NaN      NaN
12859  2018  ZAF  57.78  366.30   NaN   NaN      NaN      NaN
12860  2018  ZMB  17.35   26.72   NaN   NaN      NaN      NaN
12861  2018  ZWE  14.44   31.00   NaN   NaN      NaN      NaN

[12862 rows x 8 columns]

In [18]:
%%sql
--Here is a one line comment
/* Here is a multi line comment,
My comment continues here,
And it ends here */
SELECT * FROM indicators0

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('CHN', 1386.4, 12143.5, 76.4, 1469.88),
 ('FRA', 66.87, 2586.29, 82.5, 69.02),
 ('GBR', 66.06, 2637.87, 81.2, 79.1),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9),
 ('USA', 325.15, 19485.4, 78.5, 391.6)]

In [21]:
%%sql
-- This is to see what tables exist in the database
SELECT name FROM sqlite_master
WHERE type='table'

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('countries',), ('indicators',), ('indicators0',), ('topnames',)]

In [22]:
%%sql
SELECT * from countries
LIMIT 5

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[('ABW', 'Aruba', 'Latin America & Caribbean', 'High income', 180.0),
 ('AFG', 'Afghanistan', 'South Asia', 'Low income', 652860.0),
 ('AGO', 'Angola', 'Sub-Saharan Africa', 'Lower middle income', 1246700.0),
 ('ALB', 'Albania', 'Europe & Central Asia', 'Upper middle income', 27400.0),
 ('AND', 'Andorra', 'Europe & Central Asia', 'High income', 470.0)]

In [27]:
%%sql
PRAGMA table_info(countries)

 * sqlite:///C:\Users\bilene\Downloads\book.db
Done.

[(0, 'code', 'char(3)', 1, None, 1),
 (1, 'country', 'varchar(64)', 0, 'NULL', 0),
 (2, 'region', 'varchar(64)', 0, 'NULL', 0),
 (3, 'income', 'varchar(64)', 0, 'NULL', 0),
 (4, 'land', 'float', 0, 'NULL', 0)]